function accout = accimpellerT(Mk, w) 
% Моделирование динамики привода землеройно-транспортной машины с гидромеханической трансмиссией.
% (с) В.А.Мещеряков, 2007

% Аргументы функции - мгновенные значения:
% Mk - момент сопротивления, приведенный к движителю, Нм;
% w - угл. скорость насосного колеса, рад/с.

% Функция возвращает мгновенные значения: accout =[dw, w2, itr, LambdA, K, slipp]
% dw - угловое ускорение насосного колеса, рад/с^2
% w2 - угл. скорость турбинного колеса, рад/с
% itr - передаточное отношение ГТР

% _______________ТАБЛИЧНЫЕ ДАННЫЕ О ПАРАМЕТРАХ ЗТМ (можно задать свои)_______________
% Характеристики ЗТМ (автогрейдер ДЗ-143)
Ie = 1.8639; % момент инерции двигателя и нас. колеса с маслом, кг.м^2
I_tr = 0.32; % момент инерции турб. колеса, мех.части трансмиссии, движителей, кг.м^2
I3 = 6350; % момент инерции поступ. движ. масс ЗТМ с призмой волочения (прив. к движителю), кг.м^2
i_m = 44.67; % передаточное число мех. части трансмиссии
nu_mech = 0.97; % КПД мех. части трансмиссии
r = 0.62; % радиус движителя, м

% табличная хакрактеристика двигателя: угл. скорость и момент
% Mn = 550; % номинальный момент дизеля, Нм;
% wn = 178; % номин. угл. скорость двигателя, рад/с
we_int = ...
 [193.7315 193.5745 193.4174 193.2603 193.1032 192.9461 192.7890 192.6320 192.4749 192.3178 192.1608 192.0037 191.8466 ...
  191.6895 191.5325 191.3754 191.2183 191.0612 190.9041 190.7470 190.5900 190.4329 190.2758 190.1187 189.9616 189.8045 ...
  189.6474 189.4903 189.3333 189.1762 189.0192 188.8621 188.7051 188.5481 188.3911 188.2340 188.0770 187.9199 187.7627 ...
  187.6056 187.4484 187.2911 187.1338 186.9765 186.8192 186.6620 186.5049 186.3478 186.1909 186.0341 185.8776 185.7212 ...
  185.5649 185.4086 185.2523 185.0957 184.9389 184.7817 184.6240 184.4657 184.3068 184.1471 183.9871 183.8269 183.6672 ...
  183.5081 183.3501 183.1935 183.0387 182.8861 182.7360 182.5885 182.4426 182.2968 182.1498 182.0002 181.8466 181.6877 ...
  181.5221 181.3483 181.1652 180.9717 180.7694 180.5603 180.3462 180.1293 179.9115 179.6947 179.4810 179.2724 179.0708 ...
  178.8782 178.6967 178.5281 178.3745 178.2379 178.1203 178.0246 178.0236 174.7640 171.2271 167.5516 163.8761 160.3392 ...
  157.0796 154.1894 151.5745 149.0941 146.6077 144.0111 141.3472 138.6956 136.1357 133.7324 131.4920 129.4060 127.4660 ...
  125.6637 123.9906 122.4384 120.9986 119.6628 118.4226 117.2696 116.1955 115.1917];
 Me_int = ...
  [10.0000  15.5714  21.1429  26.7143  32.2857  37.8571  43.4286  49.0000  54.5714  60.1429  65.7143  71.2857 ...
   76.8571  82.4286  88.0000  93.5714  99.1429 104.7143 110.2857 115.8571 121.4286 127.0000 132.5714 138.1429 ...
  143.7143 149.2857 154.8571 160.4286 166.0000 171.5714 177.1429 182.7143 188.2857 193.8571 199.4286 205.0000 ...
  210.5714 216.1429 221.7143 227.2857 232.8571 238.4286 244.0000 249.5714 255.1429 260.7143 266.2857 271.8571 ...
  277.4286 283.0000 288.5714 294.1429 299.7143 305.2857 310.8571 316.4286 322.0000 327.5714 333.1429 338.7143 ...
  344.2857 349.8571 355.4286 361.0000 366.5714 372.1429 377.7143 383.2857 388.8571 394.4286 400.0000 404.5000 ...
  409.0000 413.5000 418.0000 422.5000 427.0000 431.5000 436.0000 440.5000 445.0000 450.5000 456.0000 461.5000 ...
  467.0000 472.5000 478.0000 483.5000 489.0000 494.5000 500.0000 507.1429 514.2857 521.4286 528.5714 535.7143 ...
  542.8571 550.0000 550.0000 556.4286 562.8571 569.2857 575.7143 582.1429 588.5714 595.0000 601.8571 608.7143 ...
  615.5714 622.4286 629.2857 636.1429 643.0000 645.3333 647.6667 650.0000 647.6667 645.3333 643.0000 641.1429 ...
  639.2857 637.4286 635.5714 633.7143 631.8571 630.0000];

  % Табличные характеристики ГТР:
  itr_tab = 0:0.1:1; % передаточное отношение ГТР
  K_tab = [3 2.7 2.4 2.124 1.84 1.62 1.38 1.21 1.06 0.98 0.96]; % соответствующий коэф-т трансформации
  
  % произведение коэффициента момента насоса на удельный вес жидкости и на активный диаметр в 5 степени: lambda1(i)*gamma*Dak^5 
  LambdA_tab =  [0.0139 0.0149 0.016 0.0172 0.0174 0.0174 0.0165 0.0148 0.013 0.0104 0.0069];
  
 
  % табличная зависимость коэффициента буксования от силы тяги
  % (данные Н.А.Ульянова, автогрейдер Д-144, phi=0.8)
  T_tab = [0  2453  4906  7359  9812 12265 14718 17171 19624 22077 24530 ...
       26983 29436 31889 34342 36795 39248 41701 44154 46607 49060 51513 ...
       53966 56419 58872 61325 63778 66231 68684 71137 73590 76043 78496 500000]; % сила тяги, Н
  slipp_tab = [0 0.0056 0.0095 0.0143 0.0167 0.0198 0.0238 0.0254 0.0317 ...
      0.0397 0.0437 0.0476 0.0516 0.0579 0.0619 0.0683 0.0714 0.0833 ...
      0.0913 0.0992 0.1111 0.1270 0.1429 0.1667 0.1984 0.2381 0.2857 ...
      0.3492 0.4048 0.5079 0.6508 0.8016 1  1]; % коэффициент буксования

  
  %_____________ РЕШЕНИЕ УРАВНЕНИЙ ДВИЖЕНИЯ _______________
  Me = interp1(we_int, Me_int, w); % крутящий момент двигателя - текущее значение
  
  options = optimset('Display','off'); % на экран не выводится информация о ходе решения алг.уравнений
  [x, f] = fsolve(@Equats1, [0.5 Mk], options); % решение системы алгебраических уравнений относительно itr и Md
  itr = x(1); % передаточное отношение ГТР
  Md  = x(2); % момент сцепления движителей с грунтом, Нм
  
  if itr < 0, itr = 0.01; end % защита от выхода за пределы интервала интерполяции
  if itr > 1, itr = 0.99; end

  
  %______________ Левые части алгебраических уравнений _____
  function eq = Equats1(xx)
    itr = xx(1);
    Md  = xx(2);

    LambdA = interp1(itr_tab, LambdA_tab, itr);  % соответствующий коэф-т момента
    K      = interp1(itr_tab, K_tab,      itr);  % и трансформации
    slipp  = interp1(T_tab, slipp_tab, Md/r);    % коэф-т буксования
      
    eq(1) = K * w^2 * LambdA/I_tr - Md/i_m/nu_mech/I_tr - (Md-Mk)*i_m/I3/(1-slipp);
    eq(2) = (1/Ie + K/I_tr/itr) * w^2 * LambdA - Md/i_m/itr/nu_mech/I_tr - Me/Ie;
  end
  
  %__________ Расчет выходных параметров ___________________
  LambdA = interp1(itr_tab, LambdA_tab, itr);  % соответствующий коэф-т момента*gamma*Dak^5
  K      = interp1(itr_tab, K_tab,      itr);  % и трансформации
  slipp  = interp1(T_tab, slipp_tab, Md/r);    % коэф-т буксования
  w2 = w .* itr;                               % угл.скорость турбинного колеса
  
  dw = Me/Ie - w^2 * LambdA/Ie; % угл.ускорение насосного колеса
  
  accout =[dw, w2, itr, LambdA, K, slipp]; % выход функции

end



